# Quiz11.py
####################################
# 양수면 그대로, 음수면 0 으로 변경하세요

nd1 = [10,-20,30,-40,50]


nd1 = [ i if i > 0 else 0 for i in nd1]

print(nd1)

####################################
# 100보다 넘는 값은 100으로 나눈 나머지 값으로 변경하세요
nd2 = [10,120,30,140,50]


nd2 = [i if i <= 100 else i%100 for i in nd2]

print(nd2)

####################################
# 양수면 그대로, 음수면 0 으로 변경하세요
# 100보다 넘는 값은 100으로 나눈 나머지 값으로 변경하세요

nd3 = [10,-20,130,40,-50,160,70,-80,190]



nd3 = [ i%100 if i > 0 else 0 for i in nd3]

print(nd3)

####################################
# 2자리씩 출력
nd4 = [10,20,30,40,50]

for i in range(len(nd4)):
    if i < 4:
        print(nd4[i],nd4[i+1])

####################################
# 2자리의 합
nd4 = [10,20,30,40,50]
for i in range(len(nd4)):
    if i < 4:
        print(nd4[i]+nd4[i+1])


####################################
# 2자리씩 출력
print("=-"*10)
nd5 =   [[11,12,13,14,15],
         [21,22,23,24,25],
         [31,32,33,34,35]]
for j in range(len(nd5)):
    for i in range(len(nd5[j])):
        if i < 5:
            if j < 2:
                print(nd5[j][i],nd5[j+1][i])


####################################
# 2자리씩 합계
print("=-"*10)
nd5 =   [[11,12,13,14,15],
         [21,22,23,24,25],
         [31,32,33,34,35]]
for j in range(len(nd5)):
    for i in range(len(nd5[j])):
        if i < 5:
            if j < 2:
                print(nd5[j][i]+nd5[j+1][i])